import { DuaItem } from '../../../types';

export const HealingItems: DuaItem[] = [
{
    id: 'd-h1',
    category: 'healing',
    title: 'رقية المريض وكشف البأس',
    arabic: 'أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَماً.',
    reference: 'رواه البخاري ومسلم',
    benefit: 'دعاء الرقية النبوية الشريفة لكل سقم ومرض.'
  },
{
    id: 'd-h2',
    category: 'healing',
    title: 'سؤال العافية التامة في الدنيا والآخرة',
    arabic: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي.',
    reference: 'رواه أبو داود وابن ماجه',
    benefit: 'لم يكن رسول الله ﷺ يدعهن حين يمسي وحين يصبح.'
  },
];
