import { DuaItem } from '../../../types';

export const FamilyItems: DuaItem[] = [
{
    id: 'd-f1',
    category: 'family',
    title: 'صلاح الزوجين والذرية وقرة العين',
    arabic: '﴿رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا﴾',
    reference: 'سورة الفرقان: 74',
    benefit: 'دعاء عباد الرحمن لصلاح الأسرة وقيادة التقوى.'
  },
{
    id: 'd-f2',
    category: 'family',
    title: 'دعاء إبراهيم لحفظ الصلاة',
    arabic: '﴿رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ﴾',
    reference: 'سورة إبراهيم: 40',
    benefit: 'دعاء الأنبياء للثبات على إقامة الصلاة.'
  },
];
