import { DuaItem } from '../../../types';

export const TravelItems: DuaItem[] = [
{
    id: 'd-t1',
    category: 'travel',
    title: 'دعاء الخروج من المنزل والتوكل',
    arabic: 'بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ.',
    reference: 'رواه أبو داود والترمذي',
    benefit: 'يقال له: هُدِيتَ وكُفِيتَ ووُقِيتَ، وتنحى عنه الشيطان.'
  },
{
    id: 'd-t2',
    category: 'travel',
    title: 'دعاء ركوب الدابة والسفر',
    arabic: '﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ ۝ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ﴾، اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى.',
    reference: 'سورة الزخرف: 13 / رواه مسلم',
    benefit: 'يحفظ المسافر في حله وترحاله.'
  },
];
