import { DuaItem } from '../../../types';

export const QiyamSujoodItems2: DuaItem[] = [
{
    id: 'd-qiy-4',
    category: 'qiyam_sujood',
    title: 'دعاء طلب النور الشامل',
    arabic: 'اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَأَمَامِي نُورًا، وَخَلْفِي نُورًا، وَاجْعَلْ لِي نُورًا.',
    reference: 'صحيح البخاري (6316)',
    benefit: 'كان من دعاء النبي ﷺ في قيام الليل؛ يسأل فيه النور من جميع الجوانب.'
  },
{
    id: 'd-qiy-5',
    category: 'qiyam_sujood',
    title: 'تسبيح الاستفتاح في الصلاة',
    arabic: 'سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلَا إِلَهَ غَيْرُكَ.',
    reference: 'رواه أبو داود (776)',
    benefit: 'كان النبي ﷺ يستفتح به صلاته قبل أن يقرأ.'
  },
];
