import { DuaItem } from '../../../types';

export const TravelItems2: DuaItem[] = [
{
    id: 'd-t3',
    category: 'travel',
    title: 'التعوذ بالله العظيم عند دخول البيت',
    arabic: 'أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ.',
    reference: 'رواه أبو داود (5052)',
    benefit: 'إذا قالها عند دخول بيته قال الشيطان: لا مبيت لكم ولا عشاء الليلة.'
  },
{
    id: 'd-t4',
    category: 'travel',
    title: 'دعاء الولوج والخروج من البيت',
    arabic: 'بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا.',
    reference: 'رواه أبو داود (5096)',
    benefit: 'بسم الله من كل شأن في الدخول والخروج؛ فلا يضام صاحبه.'
  },
];
