import { DhikrItem } from '../../../types';

export const MasjidItems: DhikrItem[] = [
{
    id: 'msj-1',
    category: 'masjid',
    text: 'اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَمِنْ أَمَامِي نُورًا، وَمِنْ خَلْفِي نُورًا، وَاجْعَلْ فِي نَفْسِي نُورًا، وَأَعْظِمْ لِي نُورًا.',
    count: 1,
    currentCount: 0,
    fadl: 'دعاء النبي ﷺ عند المسير والمشي إلى المسجد لصلاة الفجر والجماعة.',
    reference: 'صحيح مسلم (763)'
  },
{
    id: 'msj-2',
    category: 'masjid',
    text: 'أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ. بِسْمِ اللَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ.',
    count: 1,
    currentCount: 0,
    fadl: 'دعاء دخول المسجد؛ قال ﷺ: فإذا قال ذلك قال الشيطان: حُفظ مني سائر اليوم.',
    reference: 'رواه أبو داود وصححه الألباني'
  },
{
    id: 'msj-3',
    category: 'masjid',
    text: 'بِسْمِ اللَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ.',
    count: 1,
    currentCount: 0,
    fadl: 'دعاء الخروج من المسجد وتقديم الرجل اليسرى لطلب الرزق والفضل والحصانة.',
    reference: 'صحيح مسلم (713) وابن ماجه'
  },
{
    id: 'msj-4',
    category: 'masjid',
    text: 'ترديد الأذان خلف المؤذن جملة بجملة، وعند (حَيَّ عَلَى الصَّلَاةِ) و (حَيَّ عَلَى الْفَلَاحِ) يقال: «لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ».',
    count: 1,
    currentCount: 0,
    fadl: 'من قالها من قلبه دخل الجنة.',
    reference: 'صحيح مسلم (385)'
  },
{
    id: 'msj-5',
    category: 'masjid',
    text: 'اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ.',
    count: 1,
    currentCount: 0,
    fadl: 'قال ﷺ: حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ.',
    reference: 'صحيح البخاري (614)'
  },
{
    id: 'msj-6',
    category: 'masjid',
    text: 'وَأَنَا أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِاللَّهِ رَبًّا، وَبِمُحَمَّدٍ رَسُولًا، وَبِالإِسْلَامِ دِينًا.',
    count: 1,
    currentCount: 0,
    fadl: 'من قالها حين يسمع المؤذن غُفر له ذنبه.',
    reference: 'صحيح مسلم (386)'
  },
];
